{
  "profiles": [
    {
      "id": "niche_creator",
      "label": "🎨 Digital Creator & Affiliate",
      "settings": {
        "user_niche": "Digital Product Creator & Web Developer",
        "target_audience": "Freelancer, Programmer Pemula, Solopreneur",
        "tone_voice": "Casual, Insightful, Praktis, No Bullshit",
        "language": "Indonesian (Gaul tapi Sopan)"
      }
    },
    {
      "id": "niche_fashion",
      "label": "👗 Fashion & Beauty Model",
      "settings": {
        "user_niche": "Fashion Model & Beauty Influencer",
        "target_audience": "Fashionista, Gen Z, Pencari Style Inspiration",
        "tone_voice": "Chic, Bestie-vibes, Aesthetic, Empowering",
        "language": "Indonesian (Campur English Jaksel)"
      }
    },
    {
      "id": "niche_foodie",
      "label": "🍳 Culinary & Food Vlogger",
      "settings": {
        "user_niche": "Home Cooking & Street Food Reviewer",
        "target_audience": "Ibu Rumah Tangga, Anak Kos, Pecinta Kuliner",
        "tone_voice": "Menggugah Selera, Energetic, Ramah, 'Nyam Nyam'",
        "language": "Indonesian (Santai & Bikin Laper)"
      }
    },
    {
      "id": "niche_fitness",
      "label": "💪 Health & Fitness Coach",
      "settings": {
        "user_niche": "Personal Trainer & Diet Coach",
        "target_audience": "Orang yang ingin kurus, Gym beginners, Pekerja kantoran",
        "tone_voice": "Semangat, Motivasi Tinggi, Tegas tapi Supportif",
        "language": "Indonesian (Energetik)"
      }
    },
    {
      "id": "niche_finance",
      "label": "📈 Financial Advisor & Crypto",
      "settings": {
        "user_niche": "Financial Planner & Investor",
        "target_audience": "First Jobber, Pasangan Muda, Investor Pemula",
        "tone_voice": "Professional, Trustworthy, Edukatif, Data-driven",
        "language": "Indonesian (Formal tapi Mudah Dimengerti)"
      }
    },
    {
      "id": "niche_travel",
      "label": "✈️ Travel & Lifestyle Blogger",
      "settings": {
        "user_niche": "Travel Vlogger & Staycation Reviewer",
        "target_audience": "Backpacker, Pasangan Honeymoon, Keluarga Liburan",
        "tone_voice": "Adventurous, Storytelling, Visual, Seru",
        "language": "Indonesian (Deskriptif & Asik)"
      }
    },
    {
      "id": "niche_umkm",
      "label": "📦 UMKM & Bisnis Online",
      "settings": {
        "user_niche": "Owner Bisnis Online & Marketplace Seller",
        "target_audience": "Reseller, Dropshipper, Pengusaha Pemula",
        "tone_voice": "Relatable, Perjuangan, Tips Bisnis Realistis",
        "language": "Indonesian (Merakyat & To the Point)"
      }
    }
  ],
  "special_events": {
    "holiday_formula": {
      "id": "event_holiday",
      "style": "🎉 Edisi Spesial Libur",
      "prompt_template": "Hari ini adalah hari libur nasional: '{{holiday_name}}'. Lupakan konten teknis/jualan. Buatlah konten santai yang menghubungkan makna '{{holiday_name}}' dengan audiens {{user_niche}}. Fokus pada ucapan hangat dan doa baik."
    }
  },
  "daily_formulas": {
    "senin": [
      {
        "id": "mon_1",
        "style": "🧠 Mindset & Strategy (The Wake Up Call)",
        "templates": {
          "niche_creator": "Hari Senin seringkali jadi hari 'Procrastination'. Bahas fenomena 'Analisis Paralysis' saat mau mulai project baru. Kasih tips: 'Just write the bad code first, refactor later'.",
          "niche_fashion": "Senin pagi biasanya bingung mau pakai baju apa (Wardrobe Panic). Berikan mindset bahwa 'Style is about confidence, not brand'. Ajak followers untuk PD pakai outfit basic hari ini.",
          "niche_foodie": "Bahas kebiasaan buruk 'Jajan Sembarangan' di hari Senin karena stres kerja. Ajak audiens untuk prep meal sederhana atau bawa bekal sehat sebagai strategi hemat minggu ini.",
          "niche_fitness": "Senin adalah 'International Chest Day' di gym. Kritik kebiasaan ini secara halus. Sarankan strategi latihan yang tidak antre, atau mindset 'Don't skip Monday workout'.",
          "niche_finance": "Senin pasar saham buka. Ingatkan investor pemula untuk tidak fomo lihat chart pagi-pagi. Berikan strategi 'Set and Forget' atau mindset investasi jangka panjang.",
          "niche_travel": "Post-Holiday Blues itu nyata. Bahas perasaan malas kerja setelah weekend liburan. Berikan mindset: 'Kerja keras sekarang, biar bisa liburan mewah nanti'.",
          "niche_umkm": "Senin biasanya orderan menumpuk atau justru sepi. Berikan mindset pada seller: 'Cek stok dan balas chat adalah kunci closing'. Jangan biarkan chat customer basi."
        }
      },
      {
        "id": "mon_2",
        "style": "🔥 Hardcore Motivation (No Excuses)",
        "templates": {
          "niche_creator": "Kamu liat dev lain pamer portfolio keren dan merasa minder (Imposter Syndrome)? Stop. Bilang ke audiensmu: 'Code mereka juga pernah error. Fokus ke progressmu sendiri.'",
          "niche_fashion": "Merasa badan kurang ideal? Validasi perasaan itu, tapi tegaskan: 'Baju yang harus pas di badan kamu, bukan badan kamu yang harus pas di baju.' Embrace your shape!",
          "niche_foodie": "Masakan gagal? Gosong? Jangan nyerah. Ceritakan pengalamanmu gagal masak di awal karir. Motivasi mereka: 'Chef jago pun pernah bikin telurnya pecah.'",
          "niche_fitness": "Timbangan gak turun-turun padahal udah diet? Jangan stop! Teriakkan motivasi: 'Lemak itu perginya pelan-pelan. Konsistensi > Intensitas.' Ayo gerak sekarang!",
          "niche_finance": "Portofolio merah? Loss? Jangan panik jual rugi. Motivasi para investor muda: 'Kekayaan dibangun saat pasar berdarah, bukan saat hijau.' Stay strong.",
          "niche_travel": "Iri liat teman jalan-jalan ke Eropa? Jadikan itu bensin. Motivasi audiens: 'Jadikan bucket list travelmu sebagai alasan kenapa kamu harus hustle hari ini.'",
          "niche_umkm": "Omset lagi seret? Kompetitor banting harga? Jangan nyerah! Motivasi sesama seller: 'Rezeki gak bakal ketuker. Fokus perbaiki kualitas, customer loyal bakal datang.'"
        }
      },
      {
        "id": "mon_3",
        "style": "🎯 Weekly Goals (Action Plan)",
        "templates": {
          "niche_creator": "Share screen rencanamu: 'Minggu ini targetku kelarin fitur Login & 2 Artikel Blog'. Tantang followersmu: 'Kalian mau build apa minggu ini? Tulis 1 aja di komen!'",
          "niche_fashion": "Target fashion week ini: 'Minggu ini aku mau coba mix-match warna earth tone'. Ajak followers: 'Kalian mau coba style apa minggu ini? Drop di komen!'",
          "niche_foodie": "Target kuliner minggu ini: 'Aku mau hunting Nasi Goreng tek-tek terbaik di Jaksel'. Ajak audiens: 'Kalian lagi ngidam apa minggu ini? Kasih rekomendasi dong!'",
          "niche_fitness": "Target latihan: 'Minggu ini fokus hit 10.000 langkah/hari + No Sugar'. Tantang followers: 'Siapa berani komit lari 3x seminggu? Komen 🔥!'",
          "niche_finance": "Target keuangan: 'Minggu ini mau hemat uang kopi 50% buat nambah lot saham'. Ajak audiens: 'Satu pengeluaran apa yang mau kalian cut minggu ini?'",
          "niche_travel": "Rencana trip: 'Lagi riset tiket murah ke Bali buat bulan depan'. Tanya audiens: 'Kalian ada rencana liburan kemana? Spill destinasi impian!'",
          "niche_umkm": "Target bisnis: 'Mau rapihin feed Instagram & update stok Marketplace'. Tanya seller lain: 'PR bisnis apa yang paling malesin tapi harus kelar minggu ini?'"
        }
      }
    ],
    "selasa": [
      {
        "id": "tue_1",
        "style": "🛠️ Hard Skill Tutorial (Quick Tip)",
        "templates": {
          "niche_creator": "Tunjukkan satu shortcut VS Code atau fitur Canva yang jarang diketahui orang tapi bikin kerja 2x lebih cepat. Judul: 'Berhenti lakukan ini secara manual!'",
          "niche_fashion": "Tutorial cara tuck-in kemeja (french tuck) biar kelihatan rapi tapi effortless ala Korea. Video singkat: Before vs After.",
          "niche_foodie": "Tips dapur: Cara memotong bawang bombay tanpa menangis, atau cara agar minyak tidak meletup saat goreng ikan.",
          "niche_fitness": "Form Check! Tunjukkan cara melakukan Squat yang benar agar lutut tidak sakit. Kasih cue simpel: 'Pantat ke belakang, dada tegak'.",
          "niche_finance": "Cara baca Laporan Keuangan dalam 1 menit. Fokus ke 'Revenue' vs 'Net Profit'. Jelaskan kenapa omset gede percuma kalau boncos.",
          "niche_travel": "Cara packing baju di koper kabin biar muat banyak (teknik gulung vs lipat). Tunjukkan betapa hemat tempatnya teknik ini.",
          "niche_umkm": "Cara foto produk cuma modal HP dan cahaya matahari jendela. Tunjukkan settingan kamera HP biar hasilnya terang dan tajam."
        }
      },
      {
        "id": "tue_2",
        "style": "🔍 Tools/Product Review (Bedah Alat)",
        "templates": {
          "niche_creator": "Review jujur update terbaru AI (misal: ChatGPT vs Claude). Tes dengan satu prompt coding yang sama. Mana yang menang?",
          "niche_fashion": "Review jujur bahan baju (misal: Linen vs Katun). Mana yang lebih adem buat cuaca Indonesia? Tunjukkan teksturnya close-up.",
          "niche_foodie": "Review jajanan minimarket terbaru yang lagi hype. Apakah worth it atau cuma menang viral? Rate 1-10.",
          "niche_fitness": "Review alat gym rumahan (Resistance Band) atau Suplemen (Whey). Jawab: 'Butuh kalau..., gak butuh kalau...'",
          "niche_finance": "Review aplikasi pencatat keuangan atau aplikasi investasi. Fitur apa yang paling ngebantu kamu tracking cashflow?",
          "niche_travel": "Review aplikasi booking hotel. Tunjukkan fitur 'Price Alert' atau cara dapat diskon tersembunyi yang sering orang lewatkan.",
          "niche_umkm": "Review jasa ekspedisi atau printer thermal murah. Apakah sering macet? Apakah hasil cetaknya jelas? Rekomendasi buat seller pemula."
        }
      },
      {
        "id": "tue_3",
        "style": "⚡ Productivity Hack (Work Smarter)",
        "templates": {
          "niche_creator": "Gunakan teknik 'Time Blocking' untuk coding. Matikan notifikasi HP selama 2 jam deep work. Jelaskan dampaknya pada produktivitas.",
          "niche_fashion": "Hack lemari: Atur baju berdasarkan warna untuk memangkas waktu siap-siap di pagi hari. 'No more drama telat'.",
          "niche_foodie": "Food Prep Hack: Bikin bumbu dasar di weekend, biar pas weekday masak cuma butuh 10 menit. Tunjukkan stok bumbu di kulkas.",
          "niche_fitness": "Siapkan tas gym dan baju olahraga di malam sebelumnya. Taruh di depan pintu. Ini hack psikologis biar gak ada alasan skip.",
          "niche_finance": "Otomatisasi tabungan (Auto-debit). Begitu gaji masuk, langsung potong ke investasi. Cegah uang habis buat jajan.",
          "niche_travel": "Gunakan Google Maps 'Saved Places' untuk menandai tempat wisata sebelum berangkat. Jadi pas di lokasi gak bingung.",
          "niche_umkm": "Gunakan fitur 'Auto-Reply' di WhatsApp Business. Siapkan template jawaban untuk pertanyaan: 'Ongkir berapa?'. Hemat waktu banget!"
        }
      }
    ],
    "rabu": [
      {
        "id": "wed_1",
        "style": "📊 Case Study/Analysis (Deep Dive)",
        "templates": {
          "niche_creator": "Bedah website/aplikasi terkenal (misal: Gojek/Airbnb). Analisis UX flow mereka yang bikin user betah. Apa yang bisa ditiru developer pemula?",
          "niche_fashion": "Bedah gaya selebriti (misal: Hailey Bieber/Jennie BP). Breakdown outfit mereka menjadi item-item yang bisa dibeli versi murahnya.",
          "niche_foodie": "Analisis kenapa satu brand kopi kekinian bisa antre panjang sementara sebelahnya sepi. Apakah rasa, tempat, atau marketing?",
          "niche_fitness": "Bedah transformasi badan atlet atau aktor film action. Latihan apa yang mereka lakukan? Berapa lama prosesnya? Berikan perspektif realistis.",
          "niche_finance": "Studi kasus: Orang yang gagal finansial karena gaya hidup vs orang gaji UMR tapi punya rumah. Bedah pola pengeluaran mereka.",
          "niche_travel": "Analisis destinasi 'Hidden Gem' yang tiba-tiba viral dan rusak. Edukasi audiens tentang 'Sustainable Travel' agar tempat wisata tetap terjaga.",
          "niche_umkm": "Studi kasus brand lokal yang sukses go international. Apa strategi marketing mereka di awal? Apa pelajaran buat UMKM kecil?"
        }
      },
      {
        "id": "wed_2",
        "style": "🆚 This vs That (Perbandingan)",
        "templates": {
          "niche_creator": "Freelance vs Full-time Employee? Bandingkan stabilitas gaji vs kebebasan waktu. Mana yang cocok untuk kepribadianmu?",
          "niche_fashion": "Thrifting vs Fast Fashion? Bandingkan harga, kualitas, dan dampak lingkungan. Ajak audiens memilih kubu mana.",
          "niche_foodie": "Tim Bubur Diaduk vs Tidak Diaduk? Atau Kopi Gula Aren vs Americano? Buat perdebatan seru di kolom komentar.",
          "niche_fitness": "Cardio vs Angkat Beban untuk bakar lemak? Jelaskan mitos dan faktanya. Mana yang lebih efektif untuk pemula?",
          "niche_finance": "Nabung di Bank vs Reksadana Pasar Uang? Bandingkan bunga dan inflasi. Tunjukkan hitungan real dalam 5 tahun.",
          "niche_travel": "Solo Traveling vs Open Trip? Bandingkan budget dan fleksibilitas. Mana yang lebih seru buat introvert?",
          "niche_umkm": "Jualan di Shopee vs Tokopedia vs TikTok Shop? Bandingkan biaya admin dan karakter pembeli di masing-masing platform."
        }
      },
      {
        "id": "wed_3",
        "style": "💡 Lightbulb Moment (Insight)",
        "templates": {
          "niche_creator": "Ceritakan momen saat kamu sadar bahwa 'Clean Code' lebih penting daripada 'Clever Code'. Kode simpel itu investasi masa depan.",
          "niche_fashion": "Momen sadar bahwa mengikuti tren itu melelahkan. 'Menemukan personal style adalah kunci hemat uang dan tampil beda'.",
          "niche_foodie": "Realita bahwa 'Makanan sehat itu tidak harus hambar'. Share momen pertama kali nemu resep diet yang enak banget.",
          "niche_fitness": "Momen sadar bahwa 'Abs are made in the kitchen, not in the gym'. Olahraga gila-gilaan percuma kalau makannya sembarangan.",
          "niche_finance": "Realisasi bahwa 'Uang bukan tujuan akhir, tapi alat untuk beli waktu'. Mindset ini mengubah caramu bekerja.",
          "niche_travel": "Momen saat tersesat di kota asing dan justru menemukan pengalaman terbaik. 'Traveling is about getting lost'.",
          "niche_umkm": "Momen sadar bahwa 'Omset itu vanity, Profit itu sanity'. Berhenti ngejar angka penjualan besar kalau untungnya tipis."
        }
      }
    ],
    "kamis": [
      {
        "id": "thu_1",
        "style": "⚠️ Common Mistakes (Fatal Error)",
        "templates": {
          "niche_creator": "Kesalahan pemula: Belajar semua bahasa pemrograman sekaligus. Akibatnya tidak jago satupun. Solusi: Fokus satu stack (misal MERN) sampai jago.",
          "niche_fashion": "Kesalahan fashion: Memakai terlalu banyak warna/motif dalam satu outfit. Berikan aturan '3 Color Rule' agar terlihat elegan.",
          "niche_foodie": "Kesalahan masak: Memasukkan bahan saat minyak belum panas, atau terlalu sering membolak-balik daging. Jelaskan kenapa itu bikin rasa tidak maksimal.",
          "niche_fitness": "Kesalahan gym: Ego Lifting (angkat beban terlalu berat demi gengsi) dengan form berantakan. Ingatkan bahaya cedera.",
          "niche_finance": "Kesalahan keuangan: Tidak punya Dana Darurat tapi nekat investasi saham gorengan. Ini resep bencana finansial.",
          "niche_travel": "Kesalahan traveler: Jadwal terlalu padat (itinerary neraka). Liburan jadi capek, bukan healing. Sarankan 'Slow Travel'.",
          "niche_umkm": "Kesalahan seller: Perang harga dengan kompetitor besar. Kamu akan kalah. Solusi: Tingkatkan value dan branding, bukan turunkan harga."
        }
      },
      {
        "id": "thu_2",
        "style": "🧠 Mitos vs Fakta (Debunking)",
        "templates": {
          "niche_creator": "Mitos: 'Harus jago Matematika buat jadi Programmer'. Fakta: Logika lebih penting daripada kalkulus rumit. Bongkar mitos ini!",
          "niche_fashion": "Mitos: 'Baju mahal pasti awet'. Fakta: Banyak brand luxury jual nama, bukan kualitas kain. Edukasi cara cek jahitan.",
          "niche_foodie": "Mitos: 'MSG bikin bodoh'. Fakta: MSG aman dalam takaran wajar dan ada di tomat/keju alami. Stop takut mecin!",
          "niche_fitness": "Mitos: 'Lemak bisa berubah jadi otot'. Fakta: Itu dua jaringan berbeda. Lemak dibakar, otot dibangun. Luruskan pemahaman ini.",
          "niche_finance": "Mitos: 'Investasi butuh modal besar'. Fakta: Sekarang bisa mulai dari 10rb perak. Ajak audiens mulai aja dulu.",
          "niche_travel": "Mitos: 'Travel ke luar negeri pasti mahal'. Fakta: Tiket promo ke negara tetangga bisa lebih murah daripada domestik. Spill buktinya.",
          "niche_umkm": "Mitos: 'Customer adalah Raja'. Fakta: Tidak semua customer layak dipertahankan (toxic customer). Lindungi mental seller."
        }
      },
      {
        "id": "thu_3",
        "style": "🕰️ Throwback Thursday (Nostalgia)",
        "templates": {
          "niche_creator": "Posting screenshot website pertamamu yang desainnya hancur/norak. Tunjukkan: 'Kita semua mulai dari nol, jangan minder'.",
          "niche_fashion": "Posting foto gaya rambut/baju kamu 5-10 tahun lalu yang bikin ngakak. 'Apa yang kupikirkan waktu itu?!'",
          "niche_foodie": "Cerita makanan masa kecil yang sekarang sudah susah dicari. Ajak audiens nostalgia jajanan SD mereka.",
          "niche_fitness": "Foto kondisi badanmu sebelum mulai rajin olahraga. Ceritakan betapa sulitnya hari pertama masuk gym.",
          "niche_finance": "Cerita kesalahan finansial pertamamu (kena tipu/beli barang gak guna). Pelajaran apa yang kamu ambil?",
          "niche_travel": "Foto liburan jaman dulu saat kamera HP masih buram. Kenangan apa yang paling diingat dari trip itu?",
          "niche_umkm": "Foto packingan orderan pertama yang masih berantakan/sedikit. Apresiasi perjalanan bisnismu sampai hari ini."
        }
      }
    ],
    "jumat": [
      {
        "id": "fri_1",
        "style": "🎁 Resource Sharing (Freebies)",
        "templates": {
          "niche_creator": "List 5 Website aset grafis/icon gratis (selain Freepik) yang menyelamatkan hidup web designer. Minta audiens 'Save' postingan ini.",
          "niche_fashion": "List toko online/thrift shop hidden gem yang jual barang branded murah tapi ori. Spill nama tokonya.",
          "niche_foodie": "Share resep sambal andalan atau link pembelian alat masak murah tapi estetik di marketplace.",
          "niche_fitness": "Share playlist lagu Spotify yang bikin semangat pas workout. Atau link download planner diet gratis.",
          "niche_finance": "Share template Excel/Spreadsheet pengatur keuangan sederhana buatanmu. 'Komen MAU kalau mau link-nya'.",
          "niche_travel": "List aplikasi/website pemantau tiket promo airlines. Kasih tau cara setting notifikasinya.",
          "niche_umkm": "List supplier packaging lucu atau aplikasi edit foto produk gratis yang fiturnya premium."
        }
      },
      {
        "id": "fri_2",
        "style": "💰 Career/Money Tip (Cuan)",
        "templates": {
          "niche_creator": "Cara menaikkan rate freelance kamu tanpa takut ditinggal klien. Tips: Tawarkan 'Value' tambahan, bukan cuma jual coding.",
          "niche_fashion": "Tips belanja cerdas: 'Buy less, choose well'. Cara menghitung 'Cost per Wear' agar tidak boros beli baju yang cuma dipakai sekali.",
          "niche_foodie": "Ide bisnis kuliner modal kecil: Jualan sambal botolan atau dessert box. Analisis modal vs harga jualnya.",
          "niche_fitness": "Hemat uang member gym dengan workout di taman/rumah. Atau tips beli suplemen saat diskon besar.",
          "niche_finance": "Tips negosiasi gaji untuk first jobber. Jangan terima tawaran pertama. Ajarkan kalimat negosiasinya.",
          "niche_travel": "Tips 'Travel Hacking': Cara kumpulkan miles kartu kredit buat dapat tiket pesawat gratis.",
          "niche_umkm": "Cara menghitung HPP (Harga Pokok Penjualan) yang benar supaya gak rugi di ongkir/admin fee marketplace."
        }
      },
      {
        "id": "fri_3",
        "style": "🧘 Relax & Recharge (Self Care)",
        "templates": {
          "niche_creator": "Ingatkan developer: 'Laptop bisa di-shut down'. Ajak untuk menyentuh rumput (touch grass) weekend ini demi kesehatan mental.",
          "niche_fashion": "Jumat malam waktunya maskeran! Share rutinitas skincare malammu untuk relaksasi setelah seminggu full makeup.",
          "niche_foodie": "Rekomendasi 'Comfort Food' untuk dimakan sambil nonton series malam ini. Makanan yang bikin hati hangat.",
          "niche_fitness": "Pentingnya 'Rest Day'. Otot tumbuh saat istirahat, bukan saat dilatih. Tidur yang cukup adalah suplemen terbaik.",
          "niche_finance": "Jangan cek portofolio weekend ini. Matikan notifikasi aplikasi saham. Nikmati hasil kerjamu bersama keluarga.",
          "niche_travel": "Staycation di dalam kota juga travel. Tidak perlu jauh-jauh. Nikmati kasur hotel empuk dan sarapan enak besok pagi.",
          "niche_umkm": "Wahai owner bisnis, letakkan HP-mu. Bisnis gak akan bangkrut kalau ditinggal istirahat 1 malam. Recharge energimu."
        }
      }
    ],
    "sabtu": [
      {
        "id": "sat_1",
        "style": "🎬 Behind The Scene (Unfiltered)",
        "templates": {
          "niche_creator": "Foto meja kerja yang berantakan dengan gelas kopi dan kabel ruwet. 'Ini realita di balik kodingan rapi kalian'.",
          "niche_fashion": "Foto kamar yang kapal pecah setelah sesi try-on haul/foto OOTD. Tunjukkan effort di balik foto estetik.",
          "niche_foodie": "Foto dapur yang kotor penuh cucian piring setelah konten masak selesai. Apresiasi buat yang suka nyuci piring!",
          "niche_fitness": "Muka jelek keringetan tanpa filter habis olahraga keras. 'Glowing karena skincare ❌, Glowing karena keringat ✅'.",
          "niche_finance": "Foto setumpuk buku/catatan riset saham. Tunjukkan bahwa trading itu butuh belajar, bukan judi tebak-tebakan.",
          "niche_travel": "Realita travel: Nunggu delay pesawat, geret koper berat, atau nyasar. Bagikan sisi capek-nya traveling.",
          "niche_umkm": "Video timelapse packing ratusan paket sendirian. Tunjukkan kerja keras 'One Man Show' di balik online shop."
        }
      },
      {
        "id": "sat_2",
        "style": "😂 Entertainment/Meme (Fun)",
        "templates": {
          "niche_creator": "Meme: 'Di laptop jalan, di server error'. Atau cerita lucu klien minta 'Revisi dikit' tapi ngerombak total.",
          "niche_fashion": "Meme: Ekspektasi beli baju online vs Realita pas dipake. Ajak followers share pengalaman zonk mereka.",
          "niche_foodie": "Video lucu ekspresi kepedesan atau gagal makan estetik. Tertawakan diri sendiri itu konten yang engaging.",
          "niche_fitness": "Meme: Cara jalan setelah Leg Day (jalan kayak pinguin). Semua anak gym pasti relate.",
          "niche_finance": "Meme: Liat saldo ATM tgl 1 vs tgl 25. Humor tragis tentang gaji numpang lewat.",
          "niche_travel": "Meme: 'Mau liburan tapi dompet berkata jangan'. Relate banget buat sobat missqueen.",
          "niche_umkm": "Meme: Bunyi notifikasi 'Shopee' vs Bunyi notifikasi 'Tagihan'. Jantung deg-degan yang berbeda."
        }
      },
      {
        "id": "sat_3",
        "style": "🎮 Hobby Reveal (Personal Side)",
        "templates": {
          "niche_creator": "Share hobi non-tech: Misal main musik atau naik gunung. 'Biar gak bungkuk depan laptop terus'.",
          "niche_fashion": "Share hobi rumahan: Nonton Anime atau baca novel. Tunjukkan sisi geeky di balik image stylish-mu.",
          "niche_foodie": "Share aktivitas bakar kalori: Sepedaan atau Renang. 'Makan banyak harus diimbangi gerak'.",
          "niche_fitness": "Share 'Cheat Meal' favoritmu. Tunjukkan bahwa fitness coach juga manusia yang suka martabak/pizza.",
          "niche_finance": "Share hobi murah meriah: Berkebun atau main sama kucing. Bahagia gak harus mahal.",
          "niche_travel": "Share kegiatan saat di rumah: Masak atau crafting. Sisi 'Homebody' dari seorang traveler.",
          "niche_umkm": "Share waktu main sama anak/keluarga. 'Alasan kenapa aku kerja keras bangun bisnis ini'."
        }
      }
    ],
    "minggu": [
      {
        "id": "sun_1",
        "style": "📅 Weekly Recap & Plan (Review)",
        "templates": {
          "niche_creator": "Review kodingan minggu ini: Berhasil deploy apa? Bug apa yang masih nyangkut? Set target realistis buat besok.",
          "niche_fashion": "Outfit Recap: Post kolase 5 outfit yang kamu pakai minggu ini. Tanya audiens: 'Paling suka look hari apa?'",
          "niche_foodie": "Food Recap: Makanan terenak yang masuk perut minggu ini. Bikin audiens ngiler lagi.",
          "niche_fitness": "Weekly Weigh-in: Cek progress berat badan/lingkar perut. Ingatkan: 'Progress kecil tetaplah progress'.",
          "niche_finance": "Market Recap: Ringkasan singkat apa yang terjadi di pasar saham/crypto minggu ini. Prediksi santai buat minggu depan.",
          "niche_travel": "Lihat galeri foto minggu ini. Pilih satu foto yang belum diposting dan ceritakan story di baliknya.",
          "niche_umkm": "Laporan Mingguan: Berapa paket terkirim? Berapa komplain? Evaluasi performa toko secara transparan."
        }
      },
      {
        "id": "sun_2",
        "style": "🙋‍♀️ Q&A Session (Ask Me)",
        "templates": {
          "niche_creator": "Buka Q&A: 'Tanya apa saja soal coding, karir freelance, atau setup desk'. Jawab via IG Story/Reply.",
          "niche_fashion": "Buka Q&A: 'Bingung mix-match baju buat acara apa? Komen di bawah, aku bantuin styling'.",
          "niche_foodie": "Buka Q&A: 'Bingung mau masak apa besok? Sebutin 3 bahan di kulkasmu, aku kasih ide menu'.",
          "niche_fitness": "Buka Q&A: 'Mitos diet apa yang masih kalian bingung? Sini aku luruskan'.",
          "niche_finance": "Buka Q&A: 'Ada masalah keuangan apa yang bikin pusing? Curhat sini (anonim boleh)'.",
          "niche_travel": "Buka Q&A: 'Mau tips budget trip kemana? Tulis destinasinya, aku kasih estimasi biaya'.",
          "niche_umkm": "Buka Q&A: 'Mentok ide jualan? Atau bingung ngadepin customer rewel? Mari diskusi'. "
        }
      },
      {
        "id": "sun_3",
        "style": "🚀 Get Ready for Monday (Preparation)",
        "templates": {
          "niche_creator": "Tips Minggu Malam: Cek Trello/Jira, rapikan desktop, update OS. 'Senin pagi tinggal gas koding, gak pake update windows'.",
          "niche_fashion": "Prepare Outfit: Siapkan baju untuk Senin sampai Rabu dan setrika sekarang. 'Senin pagi anti ribet'.",
          "niche_foodie": "Meal Plan: Tulis menu masakan untuk seminggu ke depan. Belanja bahan sekarang biar besok gak bingung 'Masak apa ya?'.",
          "niche_fitness": "Siapkan jadwal workout di kalender. Treat jadwal gym seperti meeting penting yang gak boleh di-cancel.",
          "niche_finance": "Cek kalender ekonomi minggu depan. Ada rilis data inflasi/suku bunga? Siapkan strategi tradingmu.",
          "niche_travel": "Unpacking koper segera (kalau baru pulang). Jangan biarkan koper tergeletak seminggu. Cuci baju kotor, simpan paspor.",
          "niche_umkm": "Cek stok packingan (lakban, bubble wrap). Jangan sampai Senin pagi panik kehabisan lakban pas orderan masuk."
        }
      },
      {
        "id": "sun_4",
        "style": "📢 Soft Sell / Promo (Storytelling)",
        "templates": {
          "niche_creator": "Ceritakan masalah klien yang baru saja kamu selesaikan. Tutup dengan: 'Butuh solusi web serupa? DM saya'.",
          "niche_fashion": "Post foto OOTD terbaikmu. 'Baju ini lucu banget kan? Link belinya ada di bio no. 5 ya bestie'.",
          "niche_foodie": "Video masak pakai alat/bahan tertentu. 'Buat yang nanya pancinya beli dimana, cek keranjang kuning ya'.",
          "niche_fitness": "Share testimoni klien yang berhasil turun BB. 'Slot coaching bulan depan sisa 2. Siapa cepat dia dapat'.",
          "niche_finance": "Share cuplikan e-book/kelas keuanganmu. 'Kalau mau belajar lebih detail cara atur gaji, klik link di bio'.",
          "niche_travel": "Share preset Lightroom travel-mu. 'Mau foto liburanmu warnanya kayak gini? Pake preset buatanku yuk'.",
          "niche_umkm": "Info promo 'Minggu Ceria'. 'Diskon khusus hari ini sampai jam 12 malam. Besok harga naik normal'."
        }
      }
    ]
  }
}